Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNegativeWarn Property
 [Room] has a negative volume? [Room] will be ignored in the energy analysis model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomVolumeNegativeWarn { get; }
Visual Basic
Public Shared ReadOnly Property RoomVolumeNegativeWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomVolumeNegativeWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace